// -----------------------------------------------------------------------------
// Copyright (c) 2008 Think Silicon Ltd
// Think Silicon Ltd Confidential Proprietary
// -----------------------------------------------------------------------------
//     All Rights reserved - Unpublished -rights reserved under
//         the Copyright laws of the European Union
//
//  This file includes the Confidential information of Think Silicon Ltd
//  The receiver of this Confidential Information shall not disclose
//  it to any third party and shall protect its confidentiality by
//  using the same degree of care, but not less then a reasonable
//  degree of care, as the receiver uses to protect receiver's own
//  Confidential Information. The entire notice must be reproduced on all
//  authorised copies and copies may only be made to the extent permitted
//  by a licensing agreement from Think Silicon Ltd.
//
//  the software is provided 'as is', without warranty of any kind, express or
//  implied, including but not limited to the warranties of merchantability,
//  fitness for a particular purpose and noninfringement.  in no event shall the
//  Think Silicon Ltd be liable for any claim, damages or other liability, whether
//  in an action of contract, tort or otherwise, arising from, out of or in
//  connection with the software or the use or other dealings in the software.
//
//
//                    Think Silicon Ltd
//                    http://www.think-silicon.com
//                    Patras Science Park
//                    Rion Achaias 26504
//                    Greece
// -----------------------------------------------------------------------------
// FILE NAME  : Sw/Src/assist.c
// KEYWORDS   :
// PROJECT    : OpenVG
// PURPOSE    : Assist functions for debugging (open/close files, dump Graphics Memory, etc)
//              Works with Assist.v
// DEPARTMENT : online IP Products
// AUTHOR     : IS
// GENERATION : 9/30/2008  12:53
// RECEIVER   : TR
// -----------------------------------------------------------------------------
// RELEASE HISTORY for module architecture
// VERSION    DATE                      AUTHOR            DESCRIPTION
//  1.0       9/30/2008  12:53            IS            Initial Release
//  1.1      11/11/2010                   IS            Major recoding to improve portability
// -----------------------------------------------------------------------------

#ifndef _TSI_ASSIST_C_
#define _TSI_ASSIST_C_

#include <stdio.h>
#include "assist.h"
#include <stdarg.h>
//-------------------------------------------
#define BASE_Assist           0x40000000
//-------------------------------------------
//#define DEBUG_TEXT
//-------------------------------------------
T2D_TESTTYPE ref_imp = T2D_IMPL_TEST;
//-------------------------------------------------------------
typedef volatile struct __TEXTPRINT
{
    tsi_vint  character;          // 00
    tsi_vint  rname;              // 04
    tsi_vint  rdata;              // 08
    tsi_vint  wname;              // 0C
    tsi_vint  wdata;              // 10
    tsi_vint  extra1;             // 14
    tsi_vint  extra2;             // 18
    tsi_vint  extra3;             // 1C
    tsi_vint  rimage_file;        // 20
    tsi_vint  rimage_size;        // 24
    tsi_vint  rimage_offset;      // 28
    tsi_vint  kernel_file;        // 2c
    tsi_vint  kernel_size;        // 30
    tsi_vint  extra4;             // 34
    tsi_vint  extra5;             // 38
    tsi_vint  extra6;             // 3c
    tsi_vint  extra7;             // 40
    tsi_vint  tb_start;           // 44
    tsi_vint  tb_start1;          // 48 // not used
    tsi_vint  tb_start2;          // 4c // not used
    tsi_vint  PMU_CMD;            // 50
    tsi_vint  PMU_STATUS;         // 54
    tsi_vint  PMU_sleep;          // 58
    tsi_vint  fb_baseaddr;        // 5c
    tsi_vint  fb_sizeYX;          // 60
    tsi_vint  fb_color;           // 64
    tsi_vint  fb_stride;          // 68
    tsi_vint  test_report;        // 6c
    tsi_vint  test_rpt_32;        // 70
    tsi_vint  gp_input;           // 74
    tsi_vint  gp_output;          // 78
    tsi_vint  sigmon_Cntr_Ctrl;   // 7c
    tsi_vint  sigmon_Cntr;        // 80
    tsi_vint  clk_gate_ctrl;      // 84
    tsi_vint  address_mask;       // 88
    tsi_vint  address_mask_en;    // 8c
    tsi_vint  clk_ctrl;           // 90
    tsi_vint  ahb_read_delay;     // 94
    tsi_vint  random_seed;        // 98

} TEXTPRINT;

#define PTR_TEXTPRINT       ((TEXTPRINT *) BASE_Assist)
//-------------------------------------------------------------

#ifndef FPGA
typedef unsigned long uintptr_t;
void *memcpy(void *dst, const void *src, size_t len)
 {
         size_t i;

         /*
          * memcpy does not support overlapping buffers, so always do it
          * forwards. (Don't change this without adjusting memmove.)
          *
          * For speedy copying, optimize the common case where both pointers
          * and the length are word-aligned, and copy word-at-a-time instead
          * of byte-at-a-time. Otherwise, copy by bytes.
          *
          * The alignment logic below should be portable. We rely on
          * the compiler to be reasonably intelligent about optimizing
          * the divides and modulos out. Fortunately, it is.
          */

         if ((uintptr_t)dst % sizeof(long) == 0 &&
